In [1]:
import pandas as pd

In [2]:
#Define a dictionary 'x'

x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [5]:
#Retrieving the "ID" column and assigning it to a variable x
x = df[['ID']]
x

   ID
0   1
1   2
2   3
3   4

In [6]:
type(x)

pandas.core.frame.DataFrame

In [8]:
z = df[['Department','Salary','ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

In [9]:
lt = {
    'Student':['David', 'Samuel', 'Terry', 'Evan'], 
    'Age':[27, 24, 22, 32], 
    'Country':['UK', 'Canada', 'China', 'USA'], 
    'Course': ['Python', 'Data Structures', 'Machine Learning', 'Web Development'],
    'Marks': ['85', '72', '89', '76']
    }
df_lt = pd.DataFrame(lt)
df_lt

  Student  Age Country            Course Marks
0   David   27      UK            Python    85
1  Samuel   24  Canada   Data Structures    72
2   Terry   22   China  Machine Learning    89
3    Evan   32     USA   Web Development    76

In [10]:
b = df_lt[['Marks']]
b

  Marks
0    85
1    72
2    89
3    76

In [11]:
c = df_lt[['Country', 'Course']]
c

  Country            Course
0      UK            Python
1  Canada   Data Structures
2   China  Machine Learning
3     USA   Web Development

In [12]:
x = df_lt['Student']
x

0     David
1    Samuel
2     Terry
3      Evan
Name: Student, dtype: object

In [13]:
type(x)

pandas.core.series.Series

In [14]:
df.iloc[0,0]

'Rose'

In [15]:
df.iloc[0,2]

'Architect Group'

In [16]:
df.loc[0, 'Salary']

np.int64(100000)

In [17]:
df2=df
df2=df2.set_index("Name")

In [20]:
df2.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [21]:
df2.loc['Jane', 'Salary']

np.int64(50000)

In [22]:
df2.loc['Jane', 'Department']

'Design Team'

In [23]:
df2.iloc[3,2]

np.int64(60000)

In [24]:
df.iloc[0:2, 0:3]

   Name  ID       Department
0  Rose   1  Architect Group
1  John   2   Software Group